bench/rheotool/extensional_ve_planar/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Oldroyd-B planar-extension material test, matched to Kraken's 3D FVFD
// extensional canary (run_viscoelastic_fvfd_extensional_3d):
//
//   beta   = etaS/(etaS+etaP) = 0.5
//   lambda = 50 ,  epsilon_dot = 0.005  ->  lambda*epsilon_dot = 0.25
//
// Analytic Oldroyd-B planar-extension fixed point (2*lambda*eps_dot < 1):
//   C_xx = 1/(1 - 2*lambda*eps_dot) = 2.0
//   C_yy = 1/(1 + 2*lambda*eps_dot) = 2/3
//   C_zz = 1
//
// rheoTestFoam imposes nabla(U) = gradU * gammaEpsilonDotL[0]. The planar
// extension tensor diag(1,-1,0) gives U = (eps_dot*x, -eps_dot*y, 0), i.e.
// exactly the velocity field Kraken imposes (velocity_mode=:imposed).
//
// Transient mode (ramp=false): a single eps_dot is advanced to steady state.

parameters
{
                type             Oldroyd-B;

                etaS             etaS [1 -1 -1 0 0 0 0] 0.05;
                etaP             etaP [1 -1 -1 0 0 0 0] 0.05;
                lambda           lambda [0 0 1 0 0 0 0] 50;

                stabilization    none;
                rho              rho [1 -3 0 0 0 0 0] 0.;
}

rheoTestFoamParameters
{
              // Transient single-rate mode (only first gammaEpsilonDotL read)
                ramp             false;

              // Planar extension: nabla(U) = gammaEpsilonDot * diag(1,-1,0)
                gradU            ( 1.    0.    0.
                                   0.   -1.    0.
                                   0.    0.    0. );

              // Imposed extensional rate epsilon_dot (1/s)
                gammaEpsilonDotL
                  (
                        0.005
                  );
}
// ************************************************************************* //
