bench/rheotool/extensional_ve_planar/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rheoTestFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// lambda = 50; integrate to ~40*lambda so the slow C_xx mode (near the
// coil-stretch limit 2*lambda*eps_dot = 0.5) reaches its steady fixed point.
endTime         2000;

deltaT          0.5;

writeControl    timeStep;

writeInterval   4000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression compressed;

timeFormat      general;

timePrecision   10;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep off;

maxCo          0.01;

maxDeltaT      0.001;

// ************************************************************************* //
